package org.example.lessons.lesson08.homeworks

fun main() {

    val str = """
      Это невозможно выполнить за один день
      Я не уверен в успехе этого проекта
      Произошла катастрофа на сервере
      Этот код работает без проблем
      Удача
  """.trimIndent()

    println("#1")
    println(transformPhrase("Это невозможно выполнить за один день"))
    println(transformPhrase("Я не уверен в успехе этого проекта"))
    println(transformPhrase("Произошла катастрофа на сервере"))
    println(transformPhrase("Этот код работает без проблем"))
    println(transformPhrase("Удача"))

    println("#2")
    extractDateAndTime("Пользователь вошел в систему -> 2021-12-01 09:48:23")

    println("#3")
    maskCreditCard("4539 1488 0343 6467")

    println("#4")
    println(formatEmail("username@example.com"))

    println("#5")
    println(extractFileName("C:/Пользователи/Документы/report.txt"))

    println("#6")
    println(createAbbreviation("Котлин лучший язык программирования"))

    println("#7")
    println(capitalizeWords("Котлин лучший язык программирования"))

    println("#8")
    println(encrypt("Котли"))
    println(decrypt(encrypt("Котли")))

    println("#9")
    println(printMultiplicationTable(10, 10))

}

//1. Преобразование строк
// Создадропдауновйте функцию, которая будет анализировать входящие фразы и применять к ним различные преобразования,
// делая текст более ироничным или забавным. Функция должна уметь распознавать ключевые слова или условия
// и соответственно изменять фразу.
//
//Правила проверки и преобразования:
//
//Если фраза содержит слово "невозможно":
//Преобразование: Замените "невозможно" на "совершенно точно возможно, просто требует времени".
//Если фраза начинается с "Я не уверен":
//Преобразование: Добавьте в конец фразы ", но моя интуиция говорит об обратном".
//Если фраза содержит слово "катастрофа":
//Преобразование: Замените "катастрофа" на "интересное событие".
//Если фраза заканчивается на "без проблем":
//Преобразование: Замените "без проблем" на "с парой интересных вызовов на пути".
//Если фраза содержит только одно слово:
//Преобразование: Добавьте перед словом "Иногда," и после слова ", но не всегда".
//Примеры Тестовых Фраз:
//
//"Это невозможно выполнить за один день"
//"Я не уверен в успехе этого проекта"
//"Произошла катастрофа на сервере"
//"Этот код работает без проблем"
//"Удача"

fun transformPhrase (str : String) : String {
    val words = str.trim().split(" ")
    val newStr = when {
        str.contains("невозможно", true) -> str.replace("невозможно", "совершенно точно возможно, просто требует времени")
        str.startsWith("Я не уверен") -> "$str, но моя интуиция говорит об обратном"
        str.contains("катастрофа", true) -> str.replace("катастрофа", "интересное событие")
        str.endsWith("без проблем") -> str.replace("без проблем", "с парой интересных вызовов на пути")
        words.size == 1  ->  "Иногда, $str, но не всегда"
        else -> str
    }
    return newStr
}

//2. Извлечение даты из строки лога
//У вас есть строка лога, например "Пользователь вошел в систему -> 2021-12-01 09:48:23"
//(данные могут быть любыми, но формат всегда такой). Извлеките отдельно дату и время из этой строки и сразу распечатай
//их по очереди. Используй indexOf или split для получения правой части сообщения.
fun extractDateAndTime(str : String){
    val words = str.split("->")
    val dateAndTime = words[1].trim().split(" ")
    println("Действие: ${words[0].trim()}")
    println("Дата: ${dateAndTime[0]}")
    println("Время: ${dateAndTime[1]}")
}

//3. Маскирование личных данных
//Дана строка с номером кредитной карты, например "4539 1488 0343 6467".
//Замаскируйте все цифры, кроме последних четырех, символами "*".
fun maskCreditCard(str : String){
    val words = str.substring(15)
    println("**** **** **** $words")
}

//4. Форматирование адреса электронной почты.
//У вас есть электронный адрес, например "username@example.com".
//Преобразуйте его в строку "username [at] example [dot] com", используя функцию replace()
fun formatEmail(str : String): String{
    val newStr = str
        .replace("@", " [at] ")
        .replace(".", " [dot] ")
    return newStr
}

//5. Извлечение имени файла из пути.
//Дан путь к файлу, например "C:/Пользователи/Документы/report.txt" или "D:/good.themes/dracula.theme" (может быть любым).
//Извлеките название файла с расширением.
fun extractFileName(str : String) : String{
    val newStr = str.split("/")
    //val endWord = newStr[newStr.size-1]
    val endWord = newStr.last()
    return endWord
}

//6. Создание аббревиатуры из фразы.
//У вас есть фраза, например "Котлин лучший язык программирования" (может быть любой с разделителями слов - пробел).
//Создайте аббревиатуру из начальных букв слов (например, "ООП").
//
//Используйте split. Используйте for для перебора слов. Используйте var переменную для накопления первых букв.
fun createAbbreviation(str : String) : String{
    val words = str.split(" ")
    var firstLetter = ""
    for (word in words){
        firstLetter += word[0].uppercase()
    }
    return firstLetter
}

//7. Все слова с большой буквы
//Напишите метод, который преобразует строку из нескольких слов в строку, где каждое слово начинается с заглавной буквы,
//а все остальные - строчные. Используй перебор, анализ символов и замену букв на заглавную с помощью метода uppercase()
//для конкретной буквы.
fun capitalizeWords(str : String) : String{
    val words = str.split(" ")
    var str2 = ""
    for (word in words ){
        str2 += word[0].uppercase()
        str2 += word.substring(1).lowercase()
        str2 += " "
        }
    return str2.trim()
}

//8. Игра в разведчика
//Напишите шифратор/дешифратор для строки. Шифровка производится путём замены двух соседних букв между собой:
//Kotlin шифруется в oKltni. Дешифровка выполняется аналогично.
//
//Если длина строки - нечётная, в конец добавляется символ пробела до начала шифрования. Таким образом все шифрованные
//сообщения будут с чётной длинной. Должно получиться два публичных метода: encrypt() и decrypt() которые принимают
//строку и печатают результат в консоль.
fun encrypt(str : String) : String{
    var str2 = str
    var newStr = ""
    if (str.length % 2 != 0){
        str2 = str + " "
    }
    for (i in 1 .. str2.length step 2){
        newStr =newStr + str2[i] + str[i-1]
    }
    return newStr
}

fun decrypt(str : String) : String{
    var newStr = ""
    for (i in 1 .. str.length step 2){
        newStr = newStr + str[i] + str[i-1]
    }
    return newStr
}

//9. Таблица умножения
//Напишите функцию, которая принимает два числа и выводит таблицу умножения, у которой в заголовках столбцов и строк
//находятся перемножаемые числа, а в перекрестии заголовка и столбца - результат перемножения. Важно: каждый столбец
//должен быть выровнен по правому краю с помощью шаблона с форматированием строк. Размер форматирования каждой строки
//нужно вычислять динамически для каждого столбца. Результат должен быть похож на этот пример:
fun printMultiplicationTable(a : Int, b : Int){
    for (i in 1..a) {
        for (j in 1..b) {
            val width : Int = (a * b).toString().length
            print(String.format("%${width}d", i*j))
            print(" ")
        }
        println()
    }
}








